# -**- mode: org; coding: utf-8 -**-
#+TITLE: HAP - Audio Drama Project Template 
#+SUBTITLE: for Audio Theater Production, Podcasts, etc... 
#+EXPORT_FILE_NAME: HAP_Audio-Drama-Project-Template.pdf 
#+TEXT: Copyright © 2024 Harmonic Alchemy Productions & Others 
#+AUTHOR: Alisha Awen - Harmonic Alchemy Productions 
#+EMAIL: harmonicalchemy@proton.me 
#+DATE: {{{time(%A %Y-%b-%d %l%p)}}} 
#+TEXT: Created: <2019-10-01 Tue> 
#+TEXT: Last Published: <Not Published> 
#+FILETAGS: templates drama_scripts audio_theatre @projects unpublished logging 
#+DESCRIPTION: HAP Audio Theatre Project Skeleton. Great for Authors to use when starting a new Radio Drama, Podcast, News Program, or any kind of Audio-Only Production project...

****** BOILERPLATE: 

The following list contains Babel Source Code Blocks that are often needed for something I am writing or "Logging" about... I use them so much I decided to include them in this template...

- [ ] *__:* /(__)/ 

      #+begin_src conf
       keyword1:     Value1 
       keyword2:     Value2 
       keyword3:     Value 
      #+end_src

- [ ] *__:* /(__)/ 

      #+begin_src bash
       sudo dnf install emacs
       sudo apt install emacs
      #+end_src

- [ ] *__:* /(__)/ 

      #+BEGIN_SRC emacs-lisp :results output 
       ;; Initialize Local Vars from GLOBAL CONSTANTS;
       (let ((h (list 'text-pixels ME--CODE-FRAME-HEIGHT))
             (w (list 'text-pixels ME--CODE-FRAME-WIDTH)))
         (princ "CAR h: ")
         (princ (car h))
         (princ "\n")
         (princ "CDR h: ")
         (princ (cdr h))
         (princ "\n\n")
         (princ "CAR w: ")
         (princ (car w))
         (princ "\n")
         (princ "CDR w: ")
         (princ (cdr w)))
      #+END_SRC

      #+RESULTS: 
      : CAR h: text-pixels
      : CDR h: (42)
      : 
      : CAR w: text-pixels
      : CDR w: (92)

****** BOILERPLATE: 

The following list contains Babel Source Code Blocks that are often needed for something I am writing or "Logging" about... I use them so much I decided to include them in this template...

- [ ] *__:* /(__)/ 

      #+begin_src conf 
       keyword1:     Value1 
       keyword2:     Value2 
       keyword3:     Value 
      #+end_src

- [ ] *__:* /(__)/ 

      #+begin_src bash 
       sudo dnf install emacs
       sudo apt install emacs
      #+end_src

- [ ] *__:* /(__)/ 

      #+BEGIN_SRC emacs-lisp :results output 
       ;; Initialize Local Vars from GLOBAL CONSTANTS;
       (let ((h (list 'text-pixels ME--CODE-FRAME-HEIGHT))
             (w (list 'text-pixels ME--CODE-FRAME-WIDTH)))
         (princ "CAR h: ")
         (princ (car h))
         (princ "\n")
         (princ "CDR h: ")
         (princ (cdr h))
         (princ "\n\n")
         (princ "CAR w: ")
         (princ (car w))
         (princ "\n")
         (princ "CDR w: ")
         (princ (cdr w)))
      #+END_SRC

      #+RESULTS: 
      : CAR h: text-pixels
      : CDR h: (42)
      : 
      : CAR w: text-pixels
      : CDR w: (92)

****** BOILERPLATE: 

The following list contains Babel Source Code Blocks that are often needed for something I am writing or "Logging" about... I use them so much I decided to include them in this template...

- [ ] *__:* /(__)/ 

      #+begin_src conf 
       keyword1:     Value1 
       keyword2:     Value2 
       keyword3:     Value 
      #+end_src

- [ ] *__:* /(__)/ 

      #+begin_src bash 
       sudo dnf install emacs
       sudo apt install emacs
      #+end_src

- [ ] *__:* /(__)/ 

      #+BEGIN_SRC emacs-lisp :results output 
       ;; Initialize Local Vars from GLOBAL CONSTANTS;
       (let ((h (list 'text-pixels ME--CODE-FRAME-HEIGHT))
             (w (list 'text-pixels ME--CODE-FRAME-WIDTH)))
         (princ "CAR h: ")
         (princ (car h))
         (princ "\n")
         (princ "CDR h: ")
         (princ (cdr h))
         (princ "\n\n")
         (princ "CAR w: ")
         (princ (car w))
         (princ "\n")
         (princ "CDR w: ")
         (princ (cdr w)))
      #+END_SRC

      #+RESULTS: 
      : CAR h: text-pixels
      : CDR h: (42)
      : 
      : CAR w: text-pixels
      : CDR w: (92)


****** BOILERPLATE: 

The following list contains Babel Source Code Blocks that are often needed for something I am writing or "Logging" about... I use them so much I decided to include them in this template...

- [ ] *__:* /(__)/ 

      #+begin_src conf 
       keyword1:     Value1 
       keyword2:     Value2 
       keyword3:     Value 
      #+end_src

- [ ] *__:* /(__)/ 

      #+begin_src bash 
       sudo dnf install emacs
       sudo apt install emacs
      #+end_src

- [ ] *__:* /(__)/ 

    #+BEGIN_SRC emacs-lisp :results output 
       ;; Initialize Local Vars from GLOBAL CONSTANTS;
       (let ((h (list 'text-pixels ME--CODE-FRAME-HEIGHT))
             (w (list 'text-pixels ME--CODE-FRAME-WIDTH)))
         (princ "CAR h: ")
         (princ (car h))
         (princ "\n")
         (princ "CDR h: ")
         (princ (cdr h))
         (princ "\n\n")
         (princ "CAR w: ")
         (princ (car w))
         (princ "\n")
         (princ "CDR w: ")
         (princ (cdr w)))
    #+END_SRC
    #+RESULTS: 
      : CAR h: text-pixels
      : CDR h: (42)
      : 
      : CAR w: text-pixels
      : CDR w: (92)

****** BOILERPLATE: 

The following list contains Babel Source Code Blocks that are often needed for something I am writing or "Logging" about... I use them so much I decided to include them in this template...

- [ ] *__:* /(__)/ 

      #+begin_src conf 
       keyword1:     Value1 
       keyword2:     Value2 
       keyword3:     Value 
      #+end_src

- [ ] *__:* /(__)/ 

      #+begin_src bash 
       sudo dnf install emacs
       sudo apt install emacs
      #+end_src

- [ ] *__:* /(__)/ 

    #+BEGIN_SRC emacs-lisp :results output 
       ;; Initialize Local Vars from GLOBAL CONSTANTS;
       (let ((h (list 'text-pixels ME--CODE-FRAME-HEIGHT))
             (w (list 'text-pixels ME--CODE-FRAME-WIDTH)))
         (princ "CAR h: ")
         (princ (car h))
         (princ "\n")
         (princ "CDR h: ")
         (princ (cdr h))
         (princ "\n\n")
         (princ "CAR w: ")
         (princ (car w))
         (princ "\n")
         (princ "CDR w: ")
         (princ (cdr w)))
    #+END_SRC
    #+RESULTS: 
      : CAR h: text-pixels
      : CDR h: (42)
      : 
      : CAR w: text-pixels
      : CDR w: (92)

****** BOILERPLATE: 

The following list contains Babel Source Code Blocks that are often needed for something I am writing or "Logging" about... I use them so much I decided to include them in this template...

- [ ] *__:* /(__)/ 

      #+begin_src conf 
       keyword1:     Value1 
       keyword2:     Value2 
       keyword3:     Value 
      #+end_src

- [ ] *__:* /(__)/ 

      #+begin_src bash 
       sudo dnf install emacs
       sudo apt install emacs
      #+end_src

- [ ] *__:* /(__)/ 

    #+BEGIN_SRC emacs-lisp :results output 
       ;; Initialize Local Vars from GLOBAL CONSTANTS;
       (let ((h (list 'text-pixels ME--CODE-FRAME-HEIGHT))
             (w (list 'text-pixels ME--CODE-FRAME-WIDTH)))
         (princ "CAR h: ")
         (princ (car h))
         (princ "\n")
         (princ "CDR h: ")
         (princ (cdr h))
         (princ "\n\n")
         (princ "CAR w: ")
         (princ (car w))
         (princ "\n")
         (princ "CDR w: ")
         (princ (cdr w)))
    #+END_SRC
    #+RESULTS: 
      : CAR h: text-pixels
      : CDR h: (42)
      : 
      : CAR w: text-pixels
      : CDR w: (92)

